erp3l/src/DocumentJournals/ДвижениеИнвестиций/ДвижениеИнвестиций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>ДвижениеИнвестиций</name>
  <registeredDocuments>Document.ПоступлениеИнвестиций</registeredDocuments>
  <registeredDocuments>Document.ВыбытиеИнвестиций</registeredDocuments>
  <columns>
    <name>Организация</name>
  </columns>
  <columns>
    <name>Сценарий</name>
  </columns>
  <columns>
    <name>Ответственный</name>
  </columns>
  <columns>
    <name>Комментарий</name>
  </columns>
  <columns>
    <name>ОбъектИнвестирования</name>
  </columns>
  <columns>
    <name>Контрагент</name>
  </columns>
  <columns>
    <name>ПрямаяДоля</name>
  </columns>
  <columns>
    <name>Инвестиции</name>
  </columns>
  <columns>
    <name>ВалютаДокумента</name>
  </columns>
  <columns>
    <name>РегламентированныйУчет</name>
  </columns>
  <columns>
    <name>НалоговыйУчет</name>
  </columns>
  <columns>
    <name>ОтношениеКГруппе</name>
  </columns>
  <columns>
    <name>МСФОУчет</name>
  </columns>
</mdclass:DocumentJournal>

erp3l/src/Documents/ВыбытиеИнвестиций/ВыбытиеИнвестиций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыбытиеИнвестиций</name>
  <registerRecords>AccumulationRegister.ДвижениеИнвестиций</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбъектовИнвестирования</registerRecords>
  <registerRecords>InformationRegister.СамостоятельноеПризнаниеКонтроля</registerRecords>
  <registerRecords>InformationRegister.ПоследовательностиУчастия</registerRecords>
  <registerRecords>InformationRegister.ДатыПоследовательностейУчастия</registerRecords>
  <attributes>
    <name>БалансоваяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.ДоговорКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвестиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВДоверительномУправлении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГолосующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПривилегированных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МСФОУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектИнвестирования</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтношениеКГруппе</name>
    <type>
      <types>CatalogRef.ГруппыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрямаяДоля</name>
    <type>
      <types>DefinedType.ДоляВладенияНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельноеПризнаниеКонтроляНадИК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИностраннойКомпании</name>
    <type>
      <types>EnumRef.СтатусыИностранныхКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДохода</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходаСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходаСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходаСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасхода</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходаСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходаСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходаСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетов</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аннулирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
</mdclass:Document>

erp3l/src/Documents/ПоступлениеИнвестиций/ПоступлениеИнвестиций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеИнвестиций</name>
  <registerRecords>AccumulationRegister.ДвижениеИнвестиций</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбъектовИнвестирования</registerRecords>
  <registerRecords>InformationRegister.СамостоятельноеПризнаниеКонтроля</registerRecords>
  <registerRecords>InformationRegister.ПоследовательностиУчастия</registerRecords>
  <registerRecords>InformationRegister.ДатыПоследовательностейУчастия</registerRecords>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.ДоговорКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвестиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВДоверительномУправлении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГолосующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПривилегированных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МСО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МСФОУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектИнвестирования</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтношениеКГруппе</name>
    <type>
      <types>CatalogRef.ГруппыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрямаяДоля</name>
    <type>
      <types>DefinedType.ДоляВладенияНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельноеПризнаниеКонтроляНадИК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИностраннойКомпании</name>
    <type>
      <types>EnumRef.СтатусыИностранныхКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетов</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРегламент</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
</mdclass:Document>

erp3l/src/DocumentJournals/ДвижениеИнвестиций/Forms/ФормаРеестраИнвестиций/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтображатьКИК = Истина;
	ОтображатьМСФО = Истина;
	ДатаРеестра = ТекущаяДата();
	СценарийМСФО = Константы.СценарийМСФО.Получить();
	СценарийКИК = Константы.СценарийОтчетностиКИК.Получить();
	СценарийПлан = Справочники.Сценарии.План;
	УстановтьПараметрыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтображатьМСФОПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ДатаРеестраПриИзменении(Элемент)
	УстановтьПараметрыСписка()
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеестр

&НаКлиенте
Процедура РеестрВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрока = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	ЭтоМСФО = Ложь;
	ЭтоКИК = Ложь;
	Если Элемент.ТекущийЭлемент.Имя = "СписокПрямаяДоля" ИЛИ Элемент.ТекущийЭлемент.Имя = "СписокЭффективнаяДоля" ИЛИ Элемент.ТекущийЭлемент.Имя = "СписокОтношениеКГруппе" Тогда
		ЭтоМСФО = Истина;
		Если ТекущаяСтрока.ПрямаяДоля = 0 И ТекущаяСтрока.ЭффективнаяДоля <> 0 Тогда
			СообщениеОбОтсутствииПрямыхДолей();
			Возврат;
		КонецЕсли;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СписокПрямаяДоляКИК" ИЛИ Элемент.ТекущийЭлемент.Имя = "СписокЭффективнаяДоляКИК" ИЛИ Элемент.ТекущийЭлемент.Имя = "СписокСтатусИностраннойКомпании" Тогда
		ЭтоКИК = Истина;
		Если ТекущаяСтрока.ПрямаяДоляКИК = 0 И ТекущаяСтрока.ЭффективнаяДоляКИК <> 0 Тогда
			СообщениеОбОтсутствииПрямыхДолей();
			Возврат;
		КонецЕсли;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СписокПрямаяДоляПлан" ИЛИ Элемент.ТекущийЭлемент.Имя = "СписокЭффективнаяДоляПлан" ИЛИ Элемент.ТекущийЭлемент.Имя = "СписокСтатусИностраннойКомпанииПлан" ИЛИ Элемент.ТекущийЭлемент.Имя = "СписокОтношениеКГруппеПлан" Тогда
		// это план
		Если ТекущаяСтрока.ПрямаяДоляПлан = 0 И ТекущаяСтрока.ЭффективнаяДоляПлан <> 0 Тогда
			СообщениеОбОтсутствииПрямыхДолей();
			Возврат;
		КонецЕсли;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СписокИнвестор" ИЛИ Элемент.ТекущийЭлемент.Имя = "СписокОбъектИнвестирования" Тогда
		// это всё
		ЭтоМСФО = Истина;
		ЭтоКИК = Истина;
		Если ТекущаяСтрока.ПрямаяДоляПлан = 0 И ТекущаяСтрока.ЭффективнаяДоляПлан <> 0 Тогда
			СообщениеОбОтсутствииПрямыхДолей();
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Документ = ПолучитьСсылкуНаОдинДокумент(ТекущаяСтрока.Инвестор, ТекущаяСтрока.ОбъектИнвестирования, ЭтоМСФО, ЭтоКИК);
	Если Документ = Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", ТекущаяСтрока.Инвестор);
		Отбор.Вставить("ОбъектИнвестирования", ТекущаяСтрока.ОбъектИнвестирования);
		ПараметрыЖурнала = Новый Структура;
		ПараметрыЖурнала.Вставить("Отбор", Отбор);
		ОткрытьФорму("ЖурналДокументов.ДвижениеИнвестиций.Форма.ФормаСписка", ПараметрыЖурнала);
	Иначе
		ПоказатьЗначение(, Документ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сценарии(Команда)
	ВидимостьПараметров = НЕ ВидимостьПараметров;
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ВыбытиеИнвестиций(Команда)
	Если Элементы.Реестр.ТекущиеДанные <> Неопределено Тогда
		ПараметрыДокумента = Новый Структура("Организация, ОбъектИнвестирования", Элементы.Реестр.ТекущиеДанные.Инвестор, Элементы.Реестр.ТекущиеДанные.ОбъектИнвестирования);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыДокумента);
		ОткрытьФорму("Документ.ВыбытиеИнвестиций.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеИнвестиций(Команда)
	Если Элементы.Реестр.ТекущиеДанные <> Неопределено Тогда
		ПараметрыДокумента = Новый Структура("Организация, ОбъектИнвестирования", Элементы.Реестр.ТекущиеДанные.Инвестор, Элементы.Реестр.ТекущиеДанные.ОбъектИнвестирования);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыДокумента);
		ОткрытьФорму("Документ.ПоступлениеИнвестиций.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтруктураВладения(Команда)
	ПараметрыФормы = Новый Структура("ОформлениеИнвестор, ОформлениеОбъектИнвестирования, СформироватьПриОткрытии", Элементы.Реестр.ТекущиеДанные.Инвестор, Элементы.Реестр.ТекущиеДанные.ОбъектИнвестирования, Истина);
	ОткрытьФорму("Обработка.СтруктураВладения.Форма", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеВидимостью()
	Элементы.СписокГруппаМСФО.Видимость = ОтображатьМСФО;
	Элементы.СписокГруппаКИК.Видимость = ОтображатьКИК;
	Элементы.СписокГруппаПлан.Видимость = ОтображатьПлан;
	Элементы.Сценарии.Пометка = ВидимостьПараметров;	
	Элементы.Группа2.Видимость = ВидимостьПараметров;
КонецПроцедуры

&НаСервере
Процедура УстановтьПараметрыСписка()
	Реестр.Параметры.УстановитьЗначениеПараметра("ДатаСреза", КонецДня(ДатаРеестра));
	Реестр.Параметры.УстановитьЗначениеПараметра("СценарийМСФО", Константы.СценарийМСФО.Получить());
	Реестр.Параметры.УстановитьЗначениеПараметра("СценарийКИК", Константы.СценарийОтчетностиКИК.Получить());
	Реестр.Параметры.УстановитьЗначениеПараметра("СценарийПлан", Справочники.Сценарии.План);
	Элементы.Реестр.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СообщениеОбОтсутствииПрямыхДолей()
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для данного инвестора и объекта инвестирования отсутствует прямая доля участия (нет документов инвестиций).
														|Для просмотра косвенных долей рекомендуется отчет ""Структура владения""");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаОдинДокумент(Инвестор, ОбъектИнвестирования, ЭтоМСФО, ЭтоКИК)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеИнвестиций.Ссылка,
		|	1 КАК Порядок
		|ИЗ
		|	ЖурналДокументов.ДвижениеИнвестиций КАК ДвижениеИнвестиций
		|ГДЕ
		|	ДвижениеИнвестиций.Организация = &Инвестор
		|	И ДвижениеИнвестиций.ОбъектИнвестирования = &ОбъектИнвестирования
		|	И ДвижениеИнвестиций.Проведен
		|	И ВЫБОР
		|			КОГДА &ЭтоМСФО
		|					И НЕ &ЭтоКИК
		|				ТОГДА ДвижениеИнвестиций.МСФОУчет
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДвижениеИнвестиций.Ссылка,
		|	2
		|ИЗ
		|	ЖурналДокументов.ДвижениеИнвестиций КАК ДвижениеИнвестиций
		|ГДЕ
		|	ДвижениеИнвестиций.Организация = &Инвестор
		|	И ДвижениеИнвестиций.ОбъектИнвестирования = &ОбъектИнвестирования
		|	И ДвижениеИнвестиций.Проведен
		|	И ВЫБОР
		|			КОГДА &ЭтоКИК
		|					И НЕ &ЭтоМСФО
		|				ТОГДА ДвижениеИнвестиций.НалоговыйУчет
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДвижениеИнвестиций.Ссылка,
		|	3
		|ИЗ
		|	ЖурналДокументов.ДвижениеИнвестиций КАК ДвижениеИнвестиций
		|ГДЕ
		|	ДвижениеИнвестиций.Организация = &Инвестор
		|	И ДвижениеИнвестиций.ОбъектИнвестирования = &ОбъектИнвестирования
		|	И ДвижениеИнвестиций.Проведен
		|	И ВЫБОР
		|			КОГДА &ЭтоКИК
		|					И &ЭтоМСФО
		|				ТОГДА ДвижениеИнвестиций.МСФОУчет
		|						И ДвижениеИнвестиций.НалоговыйУчет
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДвижениеИнвестиций.Ссылка,
		|	4
		|ИЗ
		|	ЖурналДокументов.ДвижениеИнвестиций КАК ДвижениеИнвестиций
		|ГДЕ
		|	ДвижениеИнвестиций.Организация = &Инвестор
		|	И ДвижениеИнвестиций.ОбъектИнвестирования = &ОбъектИнвестирования
		|	И ДвижениеИнвестиций.Проведен
		|	И ВЫБОР
		|			КОГДА НЕ &ЭтоКИК
		|					И НЕ &ЭтоМСФО
		|				ТОГДА НЕ ДвижениеИнвестиций.МСФОУчет
		|						И НЕ ДвижениеИнвестиций.НалоговыйУчет
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("Инвестор", Инвестор);
	Запрос.УстановитьПараметр("ОбъектИнвестирования", ОбъектИнвестирования);
	Запрос.УстановитьПараметр("ЭтоМСФО", ЭтоМСФО);
	Запрос.УстановитьПараметр("ЭтоКИК", ЭтоКИК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
